{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "AUTH_FAILURE",
    "1": "BGP_FLAP",
    "2": "CONFIG_ERROR",
    "3": "CPU_SPIKE",
    "4": "LINK_DOWN",
    "5": "NORMAL"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AUTH_FAILURE": 0,
    "BGP_FLAP": 1,
    "CONFIG_ERROR": 2,
    "CPU_SPIKE": 3,
    "LINK_DOWN": 4,
    "NORMAL": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
